# Handing Missing Dlata

1. Removing observations
2. Filling in unknown values with the most frequent
3. Filling in values by exploring correlations
4. Filling in unknown value by exploring correlations

### Preliminaries

In [20]:
import pandas as pd
import numpy as np

### Creating Data

In [63]:
students = pd.DataFrame({'Name' : ['Justin','Kim', 'Stephen','Paul', 'Jean', 'Brian','John'],
             'Midterm_Score' : np.random.randint(70, 100, size=7),
             'Final_Score' : np.random.randint(90, 100, size=7)
             })
# Create null value in for final scores
students.Final_Score.replace(to_replace=list(range(92,97)), value=np.nan,
                            inplace=True)

students

   Final_Score  Midterm_Score     Name
0          NaN             83   Justin
1         97.0             93      Kim
2         99.0             80  Stephen
3         90.0             82     Paul
4         90.0             97     Jean
5          NaN             89    Brian
6         98.0             73     John

### 1.  Removing Rows with NaN Values

In [66]:
students.dropna()

   Final_Score  Midterm_Score     Name
1         97.0             93      Kim
2         99.0             80  Stephen
3         90.0             82     Paul
4         90.0             97     Jean
6         98.0             73     John

###  2. Filling NaN Value with Zeros

In [70]:
students.fillna(0)

   Final_Score  Midterm_Score     Name
0          0.0             83   Justin
1         97.0             93      Kim
2         99.0             80  Stephen
3         90.0             82     Paul
4         90.0             97     Jean
5          0.0             89    Brian
6         98.0             73     John

### 4. Filling NaN Values with Mean

In [71]:
students.fillna(students.Final_Score.mean())

   Final_Score  Midterm_Score     Name
0         94.8             83   Justin
1         97.0             93      Kim
2         99.0             80  Stephen
3         90.0             82     Paul
4         90.0             97     Jean
5         94.8             89    Brian
6         98.0             73     John

### 5. Filling NaN Values with Median

In [72]:
students.fillna(students.Final_Score.median())

   Final_Score  Midterm_Score     Name
0         97.0             83   Justin
1         97.0             93      Kim
2         99.0             80  Stephen
3         90.0             82     Paul
4         90.0             97     Jean
5         97.0             89    Brian
6         98.0             73     John

######

In [57]:

students

   Final_Score  Midterm_Score     Name
0         98.0             75   Justin
1          NaN             82      Kim
2         94.0             93  Stephen
3         95.0             71     Paul
4         94.0             92     Jean
5         99.0             84    Brian
6         98.0             70     John

[92, 93, 94, 95, 96]